src/InformationRegisters/МеткиКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МеткиКлиентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МеткиКлиентов/Forms/ФормаСоставМетокКлиента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
 Перем КодТекущейМетки;      
 
 #КонецОбласти
 
 #Область ОбработчикиСобытийФормы  
 
&НаСервере
// При создании формы на сервере  
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Клиент",Клиент);
	Элементы.ДекорацияКлиент.Заголовок = Строка(Клиент);
	ЗаполнитьТаблицуМетокСоздатьВизуальныеЭлементы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы 

&НаКлиенте
// Обработчик сохранения проведенных изменений
//
Процедура СохранитьИзменения(Команда)
	
	Рез = ПроверитьНеобходимостьКомментирования();
	Если Рез <> Неопределено Тогда
		
		ПоказатьПредупреждение(,Рез);
		Возврат;
		
	КонецЕсли;
	
    ЗаписатьИзменения();
	Закрыть();
	
КонецПроцедуры

 &НаКлиенте
// Обработчик флага переключения меток
//
Процедура ОбработчикВыбораМеток(Элемент)
	
	Если Элементы.ГруппаКомментарий.Видимость Тогда
		ЗавершитьКомментирование(Неопределено);
	КонецЕсли;
	
	ТекущаяМетка         = ПолучитьМеткуПоНаименованиюЭлемента(Элемент.Имя);
	ТекущаяМетка.Активна = НЕ ТекущаяМетка.Активна;
	
	ДекорацияС = Элементы["ДекорацияС_" + ТекущаяМетка.Код];
	ДекорацияК = Элементы.Найти("ДекорацияК_" + ТекущаяМетка.Код);
	
	// Метка присвоена
	Если ТекущаяМетка.Активна Тогда 
		
		ДекорацияС.Картинка = БиблиотекаКартинок.Выбран;
		
		// Если необходим комментарий
		Если ДекорацияК <> Неопределено Тогда
			
			// Элементы.ГруппаКомментарий.Видимость = Ложь;
			
			// Если отмеченная метка требует комментария и он пуст открыть поле комментария
			Если НЕ ЗначениеЗаполнено(ТекущаяМетка.Комментарий) Тогда
				
				КодТекущейМетки = ТекущаяМетка.Код; 
				ОтобразитьПолеКомментария(ТекущаяМетка.Комментарий,ТекущаяМетка.Код);	
				
			Иначе
				
				ДекорацияК.Заголовок = ТекущаяМетка.Комментарий;
				ДекорацияК.Видимость = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе // Метка снята
		
		ДекорацияС.Картинка = БиблиотекаКартинок.Невыбран;
		
		// Скрыть поле комментирвания
		Если ДекорацияК <> Неопределено Тогда
			
			ДекорацияК.Видимость                 = Ложь;
			Элементы.ГруппаКомментарий.Видимость = Ложь;
			
		КонецЕсли;	
		
		// Если комментарий изначально был проставлен требовать
		// устаноку комментария причины снятия метки
		Если ДекорацияК <> Неопределено И ТекущаяМетка.ПредСостояние Тогда
			
			// Если отмеченная метка требует комментария и он пуст открыть поле комментария
			Если НЕ ЗначениеЗаполнено(ТекущаяМетка.КомментарийСнятияМетки) Тогда
				
				КодТекущейМетки = ТекущаяМетка.Код; 
				ОтобразитьПолеКомментария(ТекущаяМетка.КомментарийСнятияМетки,ТекущаяМетка.Код);	
				
			Иначе
				
				ДекорацияК.Заголовок = ТекущаяМетка.КомментарийСнятияМетки;
				ДекорацияК.Видимость = Истина;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Обработчик нажатия на кнопку цветовой метки
//
Процедура СнятьПрисвоитьМетку(Команда) 
	
	ОбработчикВыбораМеток(ТекущийЭлемент);
	
КонецПроцедуры

&НаКлиенте
// Обработчик инициирования комментирования  
//
Процедура ОбработчикРедактированияКомментария(Элемент)
	
	Если Элементы.ГруппаКомментарий.Видимость Тогда
		ЗавершитьКомментирование(Неопределено);
	КонецЕсли;
	
	ТекущаяМетка = ПолучитьМеткуПоНаименованиюЭлемента(Элемент.Имя);
	ОтобразитьПолеКомментария(Элемент.Заголовок,ТекущаяМетка.Код);	
   
КонецПроцедуры

&НаКлиенте
// Обработчик окончания ввода текста комментария 
//
Процедура РедактированиеКомментарияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	
	ЗавершитьКомментирование(Неопределено);
	
КонецПроцедуры

&НаКлиенте
// Обработчик команды завершения редактирвоания комментария
Процедура ЗавершитьКомментирование(Команда)
	
	ДекорацияК                = Элементы.Найти("ДекорацияК_" + КодТекущейМетки);
	Если ДекорацияК = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекстКоммента                        = Элементы.РедактированиеКомментария.ТекстРедактирования;
	Элементы.ГруппаКомментарий.Видимость = Ложь;	
	
	ТекущаяМетка              = ПолучитьМеткуПоНаименованиюЭлемента("ДекорацияК_" + КодТекущейМетки);
		ДекорацияК.Видимость      = Истина;
	ДекорацияК.Заголовок      = ?(ЗначениеЗаполнено(ТекстКоммента),ТекстКоммента,"Прокомментировать");
	
	Если ТекущаяМетка.Активна Тогда
		ТекущаяМетка.Комментарий  = ТекстКоммента;
	Иначе
		ТекущаяМетка.КомментарийСнятияМетки  = ТекстКоммента;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
// Обработчик  открытия формы создания новой метки
//
Процедура ДекорацияСоздатьМеткуНажатие(Элемент)
	
	СоздатьМетку(Неопределено);
		
КонецПроцедуры

&НаКлиенте
// Обработчик кнопки создания метки 
//
Процедура СоздатьМетку(Команда)
	
	Оповещение = Новый ОписаниеОповещения("СоздатьМеткуЗавершение", ЭтаФорма);
	ОткрытьФорму("Справочник.Метки.Форма.ФормаЭлемента",,ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

 &НаКлиенте
// Получить метку по наименвоани элемента привязанного к метке 
//
Функция ПолучитьМеткуПоНаименованиюЭлемента(ИмяЭлемента)
	
	Список          = ОбщегоНазначенияКлиент.СтрокаВСписок(ИмяЭлемента,"_");
    КодМетки        = Список[1];
    КодТекущейМетки = КодМетки;	
	
    Возврат Метки.НайтиСтроки(Новый Структура("Код",КодМетки.Значение))[0];

КонецФункции

&НаСервере
// Заполнить список доступных для назначения меток
//
Процедура ЗаполнитьТаблицуМетокСоздатьВизуальныеЭлементы()
	
	Выборка = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Метки.Ссылка КАК Метка,
	|	Метки.Код,
	|	Метки.ЦветМетки,
	|	Метки.КомментироватьПриУстановке
	|ИЗ
	|	Справочник.Метки КАК Метки
	|ГДЕ
	|	Метки.ПометкаУдаления = ЛОЖЬ");
	
	// Список всех меток
	Метки.Загрузить(Выборка.Выполнить().Выгрузить());
    // Список назначенных меток
	ПрисвоенныеМетки = РегистрыСведений.МеткиКлиентов.ПолучитьМеткиКлиента(Клиент,ТекущаяДата());	
	
	Для Каждого Метка ИЗ Метки Цикл 	
		СоздатьВизуальныйЭлементМетки(Метка.Метка,ПрисвоенныеМетки,Метка);							
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
// Функция создает группу визуальных элементов привязанных к меткке,
// возвращает признак присвоенности метки клиенту
Функция СоздатьВизуальныйЭлементМетки(Метка,знач ПрисвоенныеМетки,СтрокаТаблицыМеток = Неопределено)
	
	ПрисвоенныеМетки   = ?(ПрисвоенныеМетки = Неопределено,РегистрыСведений.МеткиКлиентов.ПолучитьМеткиКлиента(Клиент,ТекущаяДата()),ПрисвоенныеМетки);
	СуществующиеМетки  = ПрисвоенныеМетки.НайтиСтроки(Новый Структура("Метка",Метка));
	УстановленнаяМетка = ?(СуществующиеМетки.Количество() > 0,СуществующиеМетки[0],Неопределено);
	
	// Размещение основной группы
	ОсновнаяГруппа                      = Элементы.Вставить("ГруппаО_" + Строка(Метка.Код),Тип("ГруппаФормы"),Элементы.ГруппаДинамическиеЭлементы,Элементы.ГруппаРедактирование);
	ОсновнаяГруппа.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	ОсновнаяГруппа.Отображение          = ОтображениеОбычнойГруппы.Нет;
	ОсновнаяГруппа.ОтображатьЗаголовок  = Ложь;
	ОсновнаяГруппа.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	
	// Размещение кнопки цвета
	НовыйЭл            = Элементы.Добавить("КнопкаЦ_" + Строка(Метка.Код),Тип("КнопкаФормы"),ОсновнаяГруппа);
	НовыйЭл.ИмяКоманды = "СнятьПрисвоитьМетку";
	НовыйЭл.Заголовок  = " ";
	НовыйЭл.ЦветФона   = ?(ЗначениеЗаполнено(Метка.ЦветМетки),ЗначениеИзСтрокиВнутр(Метка.ЦветМетки),ЦветаСтиля.ЦветФонаФормы);
	
	// Размещение декорации переключателя
	НовыйДекС             = Элементы.Добавить("ДекорацияС_"+Строка(Метка.Код),Тип("ДекорацияФормы"),ОсновнаяГруппа);
	НовыйДекС.Вид         = ВидДекорацииФормы.Картинка;
	НовыйДекС.Гиперссылка = Истина;                    	
	НовыйДекС.Ширина      = 2;
	НовыйДекС.Высота      = 1;
	НовыйДекС.Картинка    = ?(УстановленнаяМетка = Неопределено,БиблиотекаКартинок.Невыбран,БиблиотекаКартинок.Выбран);
	НовыйДекС.УстановитьДействие("Нажатие","ОбработчикВыбораМеток");
	
	// Размещение основной группы
	ГруппаПереключателя                      = Элементы.Добавить("ГруппаП_" + Строка(Метка.Код),Тип("ГруппаФормы"),ОсновнаяГруппа);
	ГруппаПереключателя.Вид                  = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПереключателя.Отображение          = ОтображениеОбычнойГруппы.Нет;
	ГруппаПереключателя.ОтображатьЗаголовок  = Ложь;
	ГруппаПереключателя.Группировка          = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	// Размещение декорации наименования метки
	НовыйДек                          = Элементы.Добавить("ДекорацияТ_"+Строка(Метка.Код),Тип("ДекорацияФормы"),ГруппаПереключателя);
	НовыйДек.Вид                      = ВидДекорацииФормы.Надпись;
	НовыйДек.Гиперссылка              = Истина;
	НовыйДек.ЦветТекста               = Новый Цвет(89,67,4);//WebЦвета.Черный;
	НовыйДек.Шрифт                    = Новый Шрифт(НовыйДек.Шрифт,,10);
	НовыйДек.РастягиватьПоГоризонтали = Истина;
	НовыйДек.Заголовок                = Метка;
	НовыйДек.УстановитьДействие("Нажатие","ОбработчикВыбораМеток");
	
	// Размещение декарации комментария
	Если Метка.КомментироватьПриУстановке Тогда
		
		ДекКомментарий             = Элементы.Добавить("ДекорацияК_"+Строка(Метка.Код),Тип("ДекорацияФормы"),ГруппаПереключателя);
		ДекКомментарий.Гиперссылка = Истина;
		ДекКомментарий.Вид         = ВидДекорацииФормы.Надпись;
		ДекКомментарий.ЦветТекста        = WebЦвета.Черный;
		ДекКомментарий.РастягиватьПоГоризонтали = Истина;
		ДекКомментарий.Заголовок   = ?(ЗначениеЗаполнено(УстановленнаяМетка) И ЗначениеЗаполнено(УстановленнаяМетка.Комментарий),УстановленнаяМетка.Комментарий,"Прокомментировать");
		ДекКомментарий.УстановитьДействие("Нажатие","ОбработчикРедактированияКомментария");
		ДекКомментарий.Видимость   = УстановленнаяМетка <> Неопределено; 
				
	КонецЕсли;
	
	Если СтрокаТаблицыМеток <> Неопределено Тогда
		
		СтрокаТаблицыМеток.Активна       = УстановленнаяМетка <> Неопределено;
		СтрокаТаблицыМеток.ПредСостояние = УстановленнаяМетка <> Неопределено;
		СтрокаТаблицыМеток.Комментарий   = ?(ЗначениеЗаполнено(УстановленнаяМетка),УстановленнаяМетка.Комментарий,""); 
		
	Иначе
		
		НоваяСтрока = Метки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Метка);
		НоваяСтрока.Метка = Метка;
		
	КонецЕсли;
	
	Возврат  УстановленнаяМетка <> Неопределено;
	
КонецФункции

&НаСервере
// Функция вернет метку которую необходимо прокоментировать 
//
Функция ПроверитьНеобходимостьКомментирования()
	
	Для Каждого Метка ИЗ Метки Цикл	
		
		Если  Метка.Метка.КомментироватьПриУстановке И ((Метка.Активна И НЕ ЗначениеЗаполнено(Метка.Комментарий))
		 ИЛИ (НЕ Метка.Активна И Метка.ПредСостояние И НЕ ЗначениеЗаполнено(Метка.КомментарийСнятияМетки))) Тогда
			
			 КодТекущейМетки = Метка.Код;
			 ОтобразитьПолеКомментария("",Метка.Код);	
			 
			 Если Метка.Активна Тогда
				 Возврат "Необходимо прокомментировать установку метки ["+Строка(Метка.Метка)+"]";
			 Иначе
				 Возврат "Необходимо прокомментировать снятие метки ["+Строка(Метка.Метка)+"]";
			 КонецЕсли;
		 
		КонецЕсли;	
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

&НаСервере
// Обработать запись проведенных изменений 
//
Процедура ЗаписатьИзменения()
	     
   Период = ТекущаяДата();
   
   Строки = Метки.НайтиСтроки(Новый Структура("ПредСостояние",Истина));

   // Проставляем пометки неактивности снятым меткам
   Для Каждого Метка ИЗ Строки Цикл
   	
   	МЗаписи = РегистрыСведений.МеткиКлиентов.СоздатьМенеджерЗаписи();
   	МЗаписи.Период       = Период;
   	МЗаписи.Клиент       = Клиент;
   	МЗаписи.Метка        = Метка.Метка;
   	МЗаписи.Автор        = ПараметрыСеанса.ТекущийПользователь;
   	МЗаписи.Комментарий  = Метка.КомментарийСнятияМетки;
   	МЗаписи.Активна      = Ложь;
   	МЗаписи.Записать(Истина);
   	
   КонецЦикла;
   
   Строки = Метки.НайтиСтроки(Новый Структура("Активна",Истина));

   // Записываем активные метки
   Для Каждого Метка ИЗ Строки Цикл
   	
   	МЗаписи = РегистрыСведений.МеткиКлиентов.СоздатьМенеджерЗаписи();
   	МЗаписи.Период       = Период;
   	МЗаписи.Клиент       = Клиент;
   	МЗаписи.Метка        = Метка.Метка;
   	МЗаписи.Автор        = ПараметрыСеанса.ТекущийПользователь;
   	МЗаписи.Комментарий  = Метка.Комментарий;
   	МЗаписи.Активна      = Истина;
   	МЗаписи.Записать(Истина);
   	
   КонецЦикла;
   
КонецПроцедуры

&НаСервере
// Процедура устанавливает поле комментария на форме в необходимое положение   
//
Процедура ОтобразитьПолеКомментария(ТекстКомментария,КодМетки)
	
	ДекорацияК                = Элементы.Найти("ДекорацияК_" + КодМетки);
	ДекорацияК.Видимость      = Ложь;
	
	Элементы.Переместить(Элементы.ГруппаКомментарий,ДекорацияК.Родитель);
	КомментарийРедактирование                    = ?(ТекстКомментария = "Прокомментировать","",ТекстКомментария);
	Элементы.ГруппаКомментарий.Видимость = Истина;
	
КонецПроцедуры

 &НаКлиенте
 Процедура СоздатьМеткуЗавершение(Результат, ДопПараметры) Экспорт
	 
 	Если НЕ Результат.Пустая() Тогда
		  СоздатьВизуальныйЭлементМетки(Результат, Неопределено);
	КонецЕсли;
	 
КонецПроцедуры	 

#КонецОбласти
